In [4]:
import pandas as pd
import numpy as np

In [5]:
a=np.array(['a','b','c','d','e'])
print(a)

['a' 'b' 'c' 'd' 'e']

In [6]:
pd.Series(a, index=[1,2,3,4,5])

1    a
2    b
3    c
4    d
5    e
dtype: object

In [7]:
x={'a':1,'b':2,'c':3}
print(x)

{'a': 1, 'b': 2, 'c': 3}

In [8]:
y=pd.Series(x)
print(y)

a    1
b    2
c    3
dtype: int64

In [9]:
y['b']

2

In [10]:
y[0:3]

a    1
b    2
c    3
dtype: int64

In [11]:
#Dataframe
ab={'Name':["Naina","Cuty","Goldy","Happy","Khusi"],
   'Roll':[12,14,16,18,19],
   'Course':["AIML","DS","Python","DA","IOT"]}
ab

{'Name': ['Naina', 'Cuty', 'Goldy', 'Happy', 'Khusi'],
 'Roll': [12, 14, 16, 18, 19],
 'Course': ['AIML', 'DS', 'Python', 'DA', 'IOT']}

In [12]:
df=pd.DataFrame(ab)
df

    Name  Roll  Course
0  Naina    12    AIML
1   Cuty    14      DS
2  Goldy    16  Python
3  Happy    18      DA
4  Khusi    19     IOT

In [13]:
df.head(3)

    Name  Roll  Course
0  Naina    12    AIML
1   Cuty    14      DS
2  Goldy    16  Python

In [14]:
df.tail(3)

    Name  Roll  Course
2  Goldy    16  Python
3  Happy    18      DA
4  Khusi    19     IOT

In [16]:
d= df.rename(columns={'Name':'Stud_Name'})
d

  Stud_Name  Roll  Course
0     Naina    12    AIML
1      Cuty    14      DS
2     Goldy    16  Python
3     Happy    18      DA
4     Khusi    19     IOT

In [17]:
d.set_index('Roll',inplace=True)

In [18]:
b=pd.DataFrame({'Days':[1,2,3,4],
                'Visitors':[1000,500,1200,700],
               'Places':['Puri','Imphal','Mumbai','Lukhnow']})

In [19]:
df=pd.DataFrame(b)
df

   Days  Visitors   Places
0     1      1000     Puri
1     2       500   Imphal
2     3      1200   Mumbai
3     4       700  Lukhnow

In [20]:
b.Visitors.sum()

3400

In [21]:
b.Visitors.mean()

850.0

In [22]:
b.count()

Days        4
Visitors    4
Places      4
dtype: int64

In [23]:
b.describe()

           Days     Visitors
count  4.000000     4.000000
mean   2.500000   850.000000
std    1.290994   310.912635
min    1.000000   500.000000
25%    1.750000   650.000000
50%    2.500000   850.000000
75%    3.250000  1050.000000
max    4.000000  1200.000000

In [24]:
b.describe(include="all")

            Days     Visitors Places
count   4.000000     4.000000      4
unique       NaN          NaN      4
top          NaN          NaN   Puri
freq         NaN          NaN      1
mean    2.500000   850.000000    NaN
std     1.290994   310.912635    NaN
min     1.000000   500.000000    NaN
25%     1.750000   650.000000    NaN
50%     2.500000   850.000000    NaN
75%     3.250000  1050.000000    NaN
max     4.000000  1200.000000    NaN

In [25]:
b.describe(include="O")

       Places
count       4
unique      4
top      Puri
freq        1

In [26]:
b.isnull()

    Days  Visitors  Places
0  False     False   False
1  False     False   False
2  False     False   False
3  False     False   False

In [27]:
b.isnull().sum()

Days        0
Visitors    0
Places      0
dtype: int64

In [28]:
b.drop('Places',axis=1)

   Days  Visitors
0     1      1000
1     2       500
2     3      1200
3     4       700

In [29]:
#uci machine learning repostery

In [35]:
#iris dataset
iris=pd.read_csv(r"C:\Users\Naina Sahu\OneDrive\Documents\CTTC\iris\iris.data", header=None)
iris

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [36]:
iris.columns = ['SL','SW','PL','PW','Class']

In [37]:
iris.head()

    SL   SW   PL   PW        Class
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [38]:
iris.tail()

      SL   SW   PL   PW           Class
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

In [41]:
iris.shape

(150, 5)

In [43]:
iris.size

750

In [44]:
iris['SL'].nunique()

35

In [45]:
for i in iris.columns:
    print(i,':',iris[i].unique())

SL : [5.1 4.9 4.7 4.6 5.  5.4 4.4 4.8 4.3 5.8 5.7 5.2 5.5 4.5 5.3 7.  6.4 6.9
 6.5 6.3 6.6 5.9 6.  6.1 5.6 6.7 6.2 6.8 7.1 7.6 7.3 7.2 7.7 7.4 7.9]
SW : [3.5 3.  3.2 3.1 3.6 3.9 3.4 2.9 3.7 4.  4.4 3.8 3.3 4.1 4.2 2.3 2.8 2.4
 2.7 2.  2.2 2.5 2.6]
PL : [1.4 1.3 1.5 1.7 1.6 1.1 1.2 1.  1.9 4.7 4.5 4.9 4.  4.6 3.3 3.9 3.5 4.2
 3.6 4.4 4.1 4.8 4.3 5.  3.8 3.7 5.1 3.  6.  5.9 5.6 5.8 6.6 6.3 6.1 5.3
 5.5 6.7 6.9 5.7 6.4 5.4 5.2]
PW : [0.2 0.4 0.3 0.1 0.5 0.6 1.4 1.5 1.3 1.6 1.  1.1 1.8 1.2 1.7 2.5 1.9 2.1
 2.2 2.  2.4 2.3]
Class : ['Iris-setosa' 'Iris-versicolor' 'Iris-virginica']

In [46]:
iris.Class.value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Class, dtype: int64

In [47]:
iris.describe(include="all")

                SL          SW          PL          PW        Class
count   150.000000  150.000000  150.000000  150.000000          150
unique         NaN         NaN         NaN         NaN            3
top            NaN         NaN         NaN         NaN  Iris-setosa
freq           NaN         NaN         NaN         NaN           50
mean      5.843333    3.054000    3.758667    1.198667          NaN
std       0.828066    0.433594    1.764420    0.763161          NaN
min       4.300000    2.000000    1.000000    0.100000          NaN
25%       5.100000    2.800000    1.600000    0.300000          NaN
50%       5.800000    3.000000    4.350000    1.300000          NaN
75%       6.400000    3.300000    5.100000    1.800000          NaN
max       7.900000    4.400000    6.900000    2.500000          NaN